Table of Contents
 Class MemberHiddenCheckClient
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class MemberHiddenCheckClient : ClientBase<IMemberHiddenCheck>, ICommunicationObject, IDisposable, IMemberHiddenCheck
Inheritance
object
ClientBase<IMemberHiddenCheck>
MemberHiddenCheckClient
Implements
ICommunicationObject
IDisposable
IMemberHiddenCheck
Inherited Members
 ClientBase<IMemberHiddenCheck>.GetDefaultValueForInitialization<T>()
 ClientBase<IMemberHiddenCheck>.Open()
 ClientBase<IMemberHiddenCheck>.Abort()
 ClientBase<IMemberHiddenCheck>.Close()
 ClientBase<IMemberHiddenCheck>.DisplayInitializationUI()
 ClientBase<IMemberHiddenCheck>.CreateChannel()
 ClientBase<IMemberHiddenCheck>.InvokeAsync(ClientBase<IMemberHiddenCheck>.BeginOperationDelegate, object[], ClientBase<IMemberHiddenCheck>.EndOperationDelegate, SendOrPostCallback, object)
 ClientBase<IMemberHiddenCheck>.Channel
 ClientBase<IMemberHiddenCheck>.CacheSetting
 ClientBase<IMemberHiddenCheck>.ChannelFactory
 ClientBase<IMemberHiddenCheck>.ClientCredentials
 ClientBase<IMemberHiddenCheck>.State
 ClientBase<IMemberHiddenCheck>.InnerChannel
 ClientBase<IMemberHiddenCheck>.Endpoint
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 MemberHiddenCheckClient(Binding, EndpointAddress)
public MemberHiddenCheckClient(Binding binding, EndpointAddress remoteAddress)
Parameters
binding Binding
remoteAddress EndpointAddress
Properties
 HiddenCalculatorId
public static int HiddenCalculatorId { get; set; }
Property Value
int
 Service
protected IMemberHiddenCheck Service { get; }
Property Value
IMemberHiddenCheck
Methods
 Calculate(int)
public string Calculate(int subStructureId)
Parameters
subStructureId int
Returns
string
 Cancel()
Cancel current calcullation
public void Cancel()
 CloseProject()
Close project which is open in the service
public void CloseProject()
 OpenProject(string)
Open idea project in the service
public void OpenProject(string projectLocation)
Parameters
projectLocation string
 Edit this page